INSERT INTO specializations (specialization_name) VALUES
('Силове тренування'),
('Йога'),
('Кардіо'),
('Аеробіка'),
('Фітнес'),
('Пілатес'),
('Стретчинг'),
('Кросфіт'),
('Масаж'),
('Реабілітація');

INSERT INTO gym (gymcol) VALUES
('Центральний зал'),
('Зал на заході'),
('Зал на півночі'),
('Південний зал'),
('Східний зал'),
('Зал у центрі міста'),
('Елітний зал'),
('Спортзал в офісному центрі'),
('Фітнес-студія'),
('Домашній зал');


INSERT INTO trainers (gym_id, trainer_id, first_name, last_name, phone_number, email, specialization_id) VALUES
(1, 1, 'Іван', 'Іваненко', '123456789', 'ivan@example.com', 1),
(1, 2, 'Марія', 'Петренко', '987654321', 'maria@example.com', 2),
(2, 3, 'Олексій', 'Сидоренко', '456789123', 'alex@example.com', 3),
(2, 4, 'Ольга', 'Кравчук', '321654987', 'olga@example.com', 4),
(1, 5, 'Анна', 'Ткаченко', '789123456', 'anna@example.com', 5),
(3, 6, 'Петро', 'Олексієнко', '555111222', 'petro@example.com', 6),
(4, 7, 'Світлана', 'Кириченко', '555333444', 'svitlana@example.com', 7),
(5, 8, 'Валерій', 'Семененко', '555555666', 'valeriy@example.com', 8),
(3, 9, 'Юлія', 'Скороход', '555777888', 'yulia@example.com', 9),
(4, 10, 'Олена', 'Гаврилюк', '555999000', 'olena@example.com', 10);

INSERT INTO schedule (gym_id, schedule_id, day_of_week, open_time, close_time) VALUES
(1, 1, 'Понеділок', '08:00', '22:00'),
(1, 2, 'Вівторок', '08:00', '22:00'),
(2, 3, 'Середа', '08:00', '22:00'),
(2, 4, 'Четвер', '08:00', '22:00'),
(1, 5, 'Пятниця', '08:00', '22:00'),
(3, 6, 'Субота', '09:00', '21:00'),
(4, 7, 'Субота', '10:00', '22:00'),
(5, 8, 'Неділя', '08:00', '20:00'),
(3, 9, 'Неділя', '07:00', '19:00'),
(4, 10, 'Неділя', '06:00', '18:00');

INSERT INTO client (gym_id, client_id, name, last_name, phone_number) VALUES
(1, 1, 'Олександр', 'Коваленко', '555-1234'),
(1, 2, 'Ольга', 'Гриценко', '555-5678'),
(2, 3, 'Дмитро', 'Левченко', '555-8765'),
(2, 4, 'Ірина', 'Бондаренко', '555-4321'),
(1, 5, 'Наталя', 'Мельник', '555-6789'),
(3, 6, 'Віктор', 'Таран', '555-1111'),
(3, 7, 'Людмила', 'Дяченко', '555-2222'),
(4, 8, 'Іван', 'Мірошниченко', '555-3333'),
(4, 9, 'Катерина', 'Леоненко', '555-4444'),
(5, 10, 'Тарас', 'Ярошенко', '555-5555');

INSERT INTO trainer_schedule (day_of_week, start_time, end_time) VALUES
('Понеділок', '09:00', '12:00'),
('Вівторок', '13:00', '16:00'),
('Середа', '09:00', '12:00'),
('Четвер', '13:00', '16:00'),
('Пятниця', '09:00', '12:00'),
('Субота', '10:00', '14:00'),
('Субота', '15:00', '19:00'),
('Неділя', '08:00', '11:00'),
('Неділя', '12:00', '15:00'),
('Неділя', '16:00', '20:00');

INSERT INTO trainers_has_trainer_schedule (gym_id, trainers_trainers_id, trainer_schedule_trainer_schedule_id) VALUES
(1, 1, 1),
(1, 2, 2),
(2, 3, 3),
(2, 4, 4),
(1, 5, 5),
(1, 1, 6),
(1, 2, 7),
(2, 3, 8),
(2, 4, 9),
(1, 5, 10);

INSERT INTO client_programs (start_date, end_date) VALUES
('2024-01-01', '2024-03-01'),
('2024-03-02', '2024-05-01'),
('2024-05-02', '2024-07-01'),
('2024-07-02', '2024-09-01'),
('2024-09-02', '2024-11-01'),
('2024-11-02', '2024-12-31'),
('2025-01-01', '2025-02-28'),
('2025-03-01', '2025-04-30'),
('2025-05-01', '2025-06-30'),
('2025-07-01', '2025-08-31');

INSERT INTO workout_programs (name, description) VALUES
('Кардіо вибух', 'Високоінтенсивне кардіо тренування'),
('Нарощування сили', 'Програма для збільшення мязової маси'),
('Аеробіка для початківців', 'Легка аеробіка для новачків'),
('Йога для релаксації', 'Розслаблююча йога для зняття стресу'),
('Фітнес марафон', 'Інтенсивна програма фітнесу'),
('Стретчинг', 'Програма для розтяжки'),
('Пілатес', 'Програма для підтримки гнучкості'),
('Кросфіт інтенсив', 'Комплекс високоінтенсивних вправ'),
('Реабілітаційні вправи', 'Програма для відновлення'),
('Масажна терапія', 'Програма з масажу для релаксації');

INSERT INTO client_has_client_programs (gym_id, client_client_id, client_programs_client_programs_id) VALUES
(1, 1, 1),
(1, 2, 2),
(2, 3, 3),
(2, 4, 4),
(1, 5, 5),
(3, 6, 6),
(3, 7, 7),
(4, 8, 8),
(4, 9, 9),
(5, 10, 10);

INSERT INTO client_programs_has_workout_programs (client_programs_client_programs_id, workout_programs_workout_programs_id) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 6),
(7, 7),
(8, 8),
(9, 9),
(10, 10);




